Revit 2024 API
BuiltInFailures.SketchFailures.InvalidProfile Property
 One or more profiles are invalid. Make sure that every used profile is a closed loop of non-intersecting lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidProfile { get; }
Visual Basic
Public Shared ReadOnly Property InvalidProfile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidProfile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace